# CannotPasteAlignedCorruption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteAlignedCorruption Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't Paste Aligned these elements in this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteAlignedCorruption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteAlignedCorruption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteAlignedCorruption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace